Heatsink study of a FPV Drone/gemFan_Cases/inlet/o0/inlet_u0/0.orig/air/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    UpperWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    LowerWall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    heatSink
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "R.*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    SideWall
    {
        //type            fixedFluxPressure;
        type            fixedValue;
        value           $internalField;
    }

    air_to_heatSink
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
