Heatsink study of a FPV Drone/gemFan_Cases/inlet/o0/inlet_u0/0.orig/air/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1E-5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    UpperWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    LowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    heatSink
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    LowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    "R.*"
    {
        type            kqRWallFunction;
        value           $internalField;    
    }
    
    SideWall
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    air_to_heatSink
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
