Heatsink study of a FPV Drone/gemFan_Cases/inlet/o0/inlet_u0/system/heatSink/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Make heat sik bottom face patch
    {
        name            boundaryFaces;
        type            faceSet;
        action          new;
        source          patchToFace;
        patch           heatSink_to_air;
    }

    {
        name            bottomHeatSink;
        type            faceSet;
        action          new;
        source          faceToFace;
        set             boundaryFaces;
    }

    {
        name            bottomHeatSink;
        type            faceSet;
        action          subset;
        source          normalToFace;
        normal          (0 0 1);
        cos             0.3;
    }
);

// ************************************************************************* //
